# parameters
nc: 1  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9

   [-4, 1, Conv, [64, 6, 2, 2]],  # 10-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 11-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 13-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 15-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 17-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 19

    ######### Fusion Block #############
   [[4,14], 1, CSIEM, [256]],    # 20 two stream fuse
   [[4,20], 1, Add2, [256,0]],  # 21-P2/8 stream one:x+trans[0]
   [[14,20], 1, Add2, [256,1]],  # 22-P2/8 stream two:x+trans[1]

   [[6,16], 1, CSIEM, [512]],    # 23 two stream fuse
   [[6,23], 1, Add2, [512,0]],  # 24-P2/16 stream one:x+trans[0]
   [[16,23], 1, Add2, [512,1]],  # 25-P2/16 stream two:x+trans[1]

   [[9,19], 1, CSIEM, [1024]],    # 26 two stream fuse
   [[9,26], 1, Add2, [1024,0]],  # 27-P2/32 stream one:x+trans[0]
   [[19,26], 1, Add2, [1024,1]],  # 28-P2/32 stream two:x+trans[1]

    ######### Cross-modality feature fusion block #############
   [[21,22], 1, TFM, [256]],   # 29-P3/8 fusion backbone P3
   [[24,25], 1, TFM, [512]],   # 30-P4/16 fusion backbone P4
   [[27,28], 1, TFM, [1024]],   # 31-P5/32 fusion backbone P5
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],          # 32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 33
   [[-1, 30], 1, Concat, [1]],           # 34 cat backbone P4
   [-1, 3, C3, [512, False]],           # 35

   [-1, 1, Conv, [256, 1, 1]],          # 36
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 37
   [[-1,29], 1, Concat, [1]],           # 38 cat backbone P3
   [-1, 3, C3, [256, False]],           # 39 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          # 40
   [[-1, 36], 1, Concat, [1]],           # 41 cat head P4
   [-1, 3, C3, [512, False]],           # 42 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          # 43
   [[-1, 32], 1, Concat, [1]],           # 44 cat head P5
   [-1, 3, C3, [1024, False]],          # 45 (P5/32-large)

   [[39, 42, 45], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]